HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
    String topicReboot = getBaseTopic() + "/system";

    mqttClient->subscribe(topicReboot,
                          [&](const String& payload)
                          {
                              if (payload == "reboot")
                              {
                                  restart();
                              }
                          });

    String topicIntervalAlive = getBaseTopic() + "/alive_interval_ms";
    mqttClient->subscribe(topicIntervalAlive,
                          [&](const String& payload)
                          {
                              settings->setAliveIntervalMillis(std::stol(payload.c_str()));
                              Serial.println("alive interval is changed to " + String(settings->getAliveIntervalMillis()));
                          });

    // Save the device configurations.
    String topicSetDeviceConfiguration = getBaseTopic() + "/save_device_config";
    mqttClient->subscribe(topicSetDeviceConfiguration,
                          [&](const String& payload)
                          {
                              Serial.println("Received device configurations -> Save it.");
                              onReceivedConnectedDevicesConfiguration(payload);
                              restart();
                          });

    // Save the project configurations.
    String topicSetMicrocontrollerConfiguration = macAddress + "/save_microcontroller_config"; // macAddress instead of getBaseTopic()!
    mqttClient->subscribe(topicSetMicrocontrollerConfiguration,
                          [&](const String& payload)
                          {
                              if (payload.length())
                              {
                                  Serial.println("Received topic + " + topicSetMicrocontrollerConfiguration +
                                                 " -> save the microcontroller configuration.");
                                  if (onReceivedMicrocontrollerConfiguration(payload))
                                  {
                                      // Remove retained message from the server
                                      mqttClient->removeRetainedMessageFromBroker(topicSetMicrocontrollerConfiguration);
                                      delay(1000);
                                      restart();
                                  }
                              }
                          });
}

#endif

/**
 * @brief Loads the configuration for the connected devices and instantiates them.
 */
void makeInstanceConfiguredDevices()
{
    Serial.println("Loading configuration and instantiate devices...");

    String jsonDeviceConfigurations = settings->loadConfiguration();
    if (0 == jsonDeviceConfigurations.length())
    {
        Serial.println("Not yet configured!");
    }
    else // if (jsonDeviceConfigurations.length() > 0)
    {
        Serial.println("Config: " + jsonDeviceConfigurations);
        DynamicJsonDocument jsonDocument(4096);

        DeserializationError error = deserializeJson(jsonDocument, jsonDeviceConfigurations);
        if (error)
        {
            Serial.print(F("deserializeJson() failed: "));
            Serial.println(error.f_str());
        }
        JsonArray arrDevices = jsonDocument.as<JsonArray>();

        for (JsonVariant value : arrDevices)
        {
            String deviceType  = value["DeviceType"];
            int    deviceIndex = value["DeviceIndex"];
            bool   isEnabled   = value["IsEnabled"];

            Serial.println("DeviceName: '" + deviceType + "', IsEnabled: " + String(isEnabled));

            if (isEnabled)
            {
                JsonArray arrPins       = value["Pins"].as<JsonArray>();
                JsonArray arrProperties = value["PropertyValues"].as<JsonArray>();

#ifdef USE_BUTTON
                if (deviceType == "Button")
                {
                    int buttonPin = arrPins[0]["MicrocontrollerGpoPin"];

                    buttonHandling.addDevice(mqttClient, getBaseTopic(), deviceIndex, buttonPin);

                    Serial.println("Button initialized.");
                }
#endif // USE_BUTTON

#ifdef USE_BUZZER
                if (deviceType == "Buzzer")
                {
                    uint8_t buzzerPin = arrPins[0]["MicrocontrollerGpoPin"];
                    uint8_t ledPin    = arrPins[1]["MicrocontrollerGpoPin"];

                    buzzer = new IotZoo::Buzzer(deviceIndex, mqttClient, getBaseTopic(), buzzerPin, ledPin);

                    Serial.println("Buzzer initialized.");
                }
#endif // USE_BUZZER

#ifdef USE_SWITCH
                if (deviceType == "Switch")
                {
                    int switchPin = arrPins[0]["MicrocontrollerGpoPin"];

                    Switch* switchBtn = new Switch(deviceIndex, mqttClient, getBaseTopic(), switchPin);
                    switches.push_back(*switchBtn);
                    Serial.println("Switch initialized.");
                }
#endif // USE_SWITCH

#ifdef USE_KEYPAD
                if (deviceType == "Keypad 4x4")
                {
                    int column3Pin = arrPins[0]["MicrocontrollerGpoPin"];
                    int column2Pin = arrPins[1]["MicrocontrollerGpoPin"];
                    int column1Pin = arrPins[2]["MicrocontrollerGpoPin"];
                    int column0Pin = arrPins[3]["MicrocontrollerGpoPin"];
                    int row0Pin    = arrPins[4]["MicrocontrollerGpoPin"];
                    int row1Pin    = arrPins[5]["MicrocontrollerGpoPin"];
                    int row2Pin    = arrPins[6]["MicrocontrollerGpoPin"];
                    int row3Pin    = arrPins[7]["MicrocontrollerGpoPin"];

                    ButtonMatrix* buttonMatrix = new ButtonMatrix(mqttClient, deviceIndex, getBaseTopic());
                    buttonMatrix->setRowPins(row0Pin, row1Pin, row2Pin, row3Pin);
                    buttonMatrix->setColPins(column0Pin, column1Pin, column2Pin, column3Pin);

                    buttonMatrixHandling.AddDevice(buttonMatrix);

