HolgerFreudenreich/IoTZoo/Esp32Client/Microcontroller/src/main.cpp
                    Serial.println("DS18B20 sensors configuration loaded! Dat Pin is " + String(datPin) + ", Resolution: " + String(resolution) +
                                   ", Transmission interval: " + String(transmissionInterval));
                }
#endif // USE_DS18B20

#ifdef USE_WS2818
                if (deviceType == "NEO" || deviceType == "Neo Pixel")
                {
                    Serial.println("Configuration of NEO pixels...");
                    int dioPin       = arrPins[0]["MicrocontrollerGpoPin"];
                    int numberOfLeds = 256;

                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];
                        if (propertyName == "numberOfLeds")
                        {
                            numberOfLeds = std::stoi(propertyValue.c_str());
                        }
                    }
                    ws2812 = new WS2818(deviceIndex, mqttClient, getBaseTopic(), dioPin, numberOfLeds);
                    Serial.println("Neo pixel configuration loaded! DIO Pin is " + String(dioPin) + ", Leds: " + String(numberOfLeds));
                }
#endif // USE_WS2818

#ifdef USE_TM1637_4
                if (deviceType == "TM1637_4")
                {
                    Serial.println("TM1637_4 display");

                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dioPin = arrPins[1]["MicrocontrollerGpoPin"];

                    bool   flipDisplay = false;
                    String serverDownText;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "flipDisplay")
                        {
                            propertyValue.toLowerCase();
                            flipDisplay = propertyValue == "true";
                        }
                        else if (propertyName == "serverDownText")
                        {
                            propertyValue.toLowerCase();
                            serverDownText = propertyValue;
                        }
                    }

                    tm1637_4Handling.addDevice(getBaseTopic(), deviceIndex, clkPin, dioPin, flipDisplay, serverDownText);
                    Serial.println("TM1637_4 display with deviceIndex " + String(deviceIndex) + " initialized! CLK Pin is " + String(clkPin) +
                                   ", DIO Pin is " + String(dioPin) + ", FlipDisplay: " + String(flipDisplay));
                }
#endif // USE_TM1637_4

#ifdef USE_TM1637_6
                if (deviceType == "TM1637_6")
                {
                    Serial.println("TM1637_6 display");

                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dioPin = arrPins[1]["MicrocontrollerGpoPin"];

                    bool   flipDisplay = false;
                    String serverDownText;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "flipDisplay")
                        {
                            propertyValue.toLowerCase();
                            flipDisplay = propertyValue == "true";
                        }
                        else if (propertyName == "serverDownText")
                        {
                            propertyValue.toLowerCase();
                            serverDownText = propertyValue;
                        }
                    }

                    tm1637_6Handling.addDevice(getBaseTopic(), deviceIndex, clkPin, dioPin, flipDisplay, serverDownText);

                    Serial.println("TM1637_6 display initialized! CLK Pin is " + String(clkPin) + ", DIO Pin is " + String(dioPin));
                }
#endif // USE_TM1637_6

#ifdef USE_LED_AND_KEY
                if (deviceType == "TM1638")
                {
                    Serial.println("TM1638_8 display");

                    int strobePin = arrPins[0]["MicrocontrollerGpoPin"];
                    int clkPin    = arrPins[1]["MicrocontrollerGpoPin"];
                    int dioPin    = arrPins[2]["MicrocontrollerGpoPin"];

                    tm1638 = new TM1638(deviceIndex, mqttClient, getBaseTopic(), strobePin, clkPin, dioPin);

                    Serial.println("TM1638 display initialized! Strobe Pin is " + String(strobePin) + ", CLK Pin is " + String(clkPin) +
                                   ", DIO Pin is " + String(dioPin));
                }
#endif // USE_LED_AND_KEY

#ifdef USE_REMOTE_GPIOS
                if (deviceType == "Remote GPIO")
                {
                    Serial.println("Remote GPIO");

                    int gpioPin = arrPins[0]["MicrocontrollerGpoPin"];

                    RemoteGpio* remoteGpio = new RemoteGpio(deviceIndex, mqttClient, getBaseTopic(), gpioPin);
                    remoteGpios.push_back(*remoteGpio);
                    Serial.println("Remote GPIO PIN configuration loaded! Pin is " + String(gpioPin) + ". Size remoteGpios: " + remoteGpios.size());
                }
#endif // USE_REMOTE_GPIOS

#ifdef USE_TRAFFIC_LIGHT_LEDS
                if (deviceType == "LEDS Traffic Light")
                {
                    Serial.println("LEDS Traffic Light");

                    int gpioLedRed    = -1;
                    int gpioLedYellow = -1;
                    int gpioLedGreen  = -1;

                    for (JsonVariant property : arrPins)
                    {
                        String propertyName  = property["PinName"];
                        String propertyValue = property["MicrocontrollerGpoPin"];
                        Serial.println("propertyName: " + propertyName + ", propertyValue: " + propertyValue);

                        if (propertyName == "R")
                        {
                            gpioLedRed = std::stoi(propertyValue.c_str());
                            Serial.println("Red Gpio: " + gpioLedRed);
                        }
                        else if (propertyName == "Y")
                        {
                            gpioLedYellow = std::stoi(propertyValue.c_str());
                            Serial.println("Yellow Gpio: " + gpioLedYellow);
                        }
                        else if (propertyName == "G")
                        {
                            gpioLedGreen = std::stoi(propertyValue.c_str());
                            Serial.println("Green Gpio: " + gpioLedGreen);
                        }
                    }

                    if (gpioLedRed != -1 && gpioLedYellow != -1 && gpioLedGreen != -1)
                    {
                        TrafficLight* trafficLight =
                            new TrafficLight(deviceIndex, mqttClient, getBaseTopic(), gpioLedRed, gpioLedYellow, gpioLedGreen);
                        trafficLightLeds.push_back(*trafficLight);
                    }
                }
#endif // USE_TRAFFIC_LIGHT_LEDS

#ifdef USE_HW040
                if (deviceType == "HW-040")
                {
                    Serial.println("HW-040 rotary encoder");
                    int clkPin = arrPins[0]["MicrocontrollerGpoPin"];
                    int dtPin  = arrPins[1]["MicrocontrollerGpoPin"];
                    int swPin  = arrPins[2]["MicrocontrollerGpoPin"];

                    int  boundaryMinValue = 0;
                    int  boundaryMaxValue = 255;
                    bool circleValues     = false;
                    int  acceleration     = 250;
                    int  encoderSteps     = 2;
                    for (JsonVariant property : arrProperties)
                    {
                        String propertyName  = property["Name"];
                        String propertyValue = property["Value"];

                        if (propertyName == "BoundaryMinValue")
                        {
                            boundaryMinValue = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "BoundaryMaxValue")
                        {
                            boundaryMaxValue = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "Acceleration")
                        {
                            acceleration = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "EncoderSteps")
                        {
                            encoderSteps = std::stoi(propertyValue.c_str());
                        }

                        if (propertyName == "CircleValue")
                        {
                            circleValues = propertyValue == "true";
                        }
                    }

                    hw040Handling.addDevice(mqttClient, getBaseTopic(), deviceIndex, boundaryMinValue, boundaryMaxValue, circleValues, acceleration,
                                            encoderSteps, clkPin, dtPin, swPin, -1);
                    Serial.println("HW-040 rotary encoder initialized! CLK Pin is " + String(clkPin) + ", DT Pin is " + String(dtPin) +
                                   ", MS Pin is " + String(swPin) + ", boundaryMinValue is " + String(boundaryMinValue) + ", boundaryMaxValue is " +
                                   String(boundaryMaxValue) + ", acceleration is " + String(acceleration) + ", circleValues is " +
                                   String(circleValues) + ", encoderSteps is " + String(encoderSteps));
                }
#endif // USE_HW040

